{
  "breakdowns": [
    {
      "id": "energy_data_collection",
      "header": "Energy Data Collection",
      "description": "Fetches energy generation data from a configurable external endpoint every 1 minute, stores timestamped energy data in the database, retries failed requests up to 3 times, logs errors using standard logging, and validates that only data in Mega watt hour units is accepted.",
      "conditions": [
        "Data must be fetched every 1 minute from an external endpoint configurable via environment variable.",
        "Fetched data must be timestamped and stored in the database.",
        "Failed requests must be retried automatically up to 3 attempts.",
        "Errors must be logged using standard logging.",
        "Only accept and store energy data if it is in Mega watt hour units."
      ],
      "change_status": ""
    },
    {
      "id": "user_onboarding",
      "header": "User Onboarding",
      "description": "Allows users to register with basic information (Name, Email, Password) and optionally submit a picture of the energy source and supporting documents (PDF/image). Uploaded files are validated for type (image/*, application/pdf) and size (limit: 5MB) and stored locally under onboardingdoc/{userid}. A link to the home page (dashboard) must be provided during onboarding to allow skipping uploads, and access to the dashboard is allowed even if documents are not uploaded.",
      "conditions": [
        "Users can register with basic information (Name, Email, Password).",
        "Users may optionally submit a picture of the energy source during onboarding.",
        "Users may optionally submit supporting documents (PDF/image) during onboarding.",
        "Uploaded files must be validated for type (image/*, application/pdf) and size (limit: 5MB).",
        "All files must be stored locally under onboardingdoc/{userid}.",
        "A link to the home page (dashboard) must be provided during onboarding to allow skipping uploads.",
        "Access to the main dashboard must be allowed even if documents are not uploaded."
      ],
      "change_status": ""
    },
    {
      "id": "energy_monitoring",
      "header": "Energy Monitoring",
      "description": "Displays current energy generated for the user’s energy source on the home page and allows users to view historical energy data in table or chart format.",
      "conditions": [
        "Home page must display current energy generated for the user’s energy source.",
        "Users must be able to view historical energy data in table or chart format."
      ],
      "change_status": ""
    }
  ],
  "last_updated": "2025-12-28T05:16:29.434518",
  "version": "1.0"
}